tumejorsonrisa_backend/app/controllers/patients_controller.rb

SELECT "patients".* FROM "patients"
---
    def index
      @patients = Patient.all

DELETE FROM "patients" WHERE "patients"."id" = ?  [["id", 3]]
---
    def destroy
      @patient.destroy

SELECT "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_patient
      @patient = Patient.find(params[:id])